# Projet 6 : Analysez les ventes d'une librairie avec R ou Python

# Préparation des données

## Import des librairies

In [165]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as st

folder = 'D:/Data_Analyst_Projet/Projet 6/Donnees python/'

## Import des fichiers

In [166]:
customers=pd.read_csv(folder+'customers.csv')
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [167]:
products=pd.read_csv(folder+'products.csv')
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [168]:
transactions=pd.read_csv(folder+'transactions.csv')
transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

## Fichier customers

In [169]:
customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

### Exploration

In [170]:
customers.shape

(8623, 3)

In [171]:
customers.info()
# pas de valeurs manquantes à priori

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

In [172]:
customers.describe(include='all')
# pas de doublons de clients, moyenne et médiane de birth proche, pas de valeurs abberantes à priori

       client_id   sex        birth
count       8623  8623  8623.000000
unique      8623     2          NaN
top       c_4410     f          NaN
freq           1  4491          NaN
mean         NaN   NaN  1978.280877
std          NaN   NaN    16.919535
min          NaN   NaN  1929.000000
25%          NaN   NaN  1966.000000
50%          NaN   NaN  1979.000000
75%          NaN   NaN  1992.000000
max          NaN   NaN  2004.000000

### Traitement des valeurs nulles

In [173]:
customers.isna().sum()
# pas de valeurs manquantes comme on avait vu avec info()

client_id    0
sex          0
birth        0
dtype: int64

### Traitement des doublons

In [174]:
customers[customers.duplicated(subset='client_id')]
# pas de doublons comme on avait vu avec describe()

Empty DataFrame
Columns: [client_id, sex, birth]
Index: []

### Ajout de la colonne âge

In [175]:
customers['age']=2023 - customers['birth']
customers.head()

  client_id sex  birth  age
0    c_4410   f   1967   56
1    c_7839   f   1975   48
2    c_1699   f   1984   39
3    c_5961   f   1962   61
4    c_5320   m   1943   80

In [176]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
 3   age        8623 non-null   int64
dtypes: int64(2), object(2)
memory usage: 269.6+ KB

In [177]:
customers.describe()

             birth          age
count  8623.000000  8623.000000
mean   1978.280877    44.719123
std      16.919535    16.919535
min    1929.000000    19.000000
25%    1966.000000    31.000000
50%    1979.000000    44.000000
75%    1992.000000    57.000000
max    2004.000000    94.000000

### Modification des unités

In [178]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   object
 2   birth      8623 non-null   int64
 3   age        8623 non-null   int64
dtypes: int64(2), object(2)
memory usage: 269.6+ KB

In [179]:
customers['sex']=customers['sex'].astype('category')

In [180]:
customers.dtypes

client_id      object
sex          category
birth           int64
age             int64
dtype: object

In [181]:
customers.head()

  client_id sex  birth  age
0    c_4410   f   1967   56
1    c_7839   f   1975   48
2    c_1699   f   1984   39
3    c_5961   f   1962   61
4    c_5320   m   1943   80

## Fichier products

In [182]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

### Exploration

In [183]:
products.info()
# pas de valeurs manquantes à priori

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.2+ KB

In [184]:
products.describe(include='all')
# pas de doublons pour id_product à priori
# le min à -1 --> déterminer la raison

       id_prod        price        categ
count     3287  3287.000000  3287.000000
unique    3287          NaN          NaN
top     0_1421          NaN          NaN
freq         1          NaN          NaN
mean       NaN    21.856641     0.370246
std        NaN    29.847908     0.615387
min        NaN    -1.000000     0.000000
25%        NaN     6.990000     0.000000
50%        NaN    13.060000     0.000000
75%        NaN    22.990000     1.000000
max        NaN   300.000000     2.000000

### Traitement des valeurs manquantes

In [185]:
products.isna().sum()
# pas de valeurs manquantes

id_prod    0
price      0
categ      0
dtype: int64

### Traitement des doublons

In [186]:
products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [187]:
products[products.duplicated('id_prod')]
# pas de doublons

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

### Modification des unités

In [188]:
products['categ']=products['categ'].astype('category')

In [189]:
products.dtypes

id_prod      object
price       float64
categ      category
dtype: object

### Traitement des valeurs abberantes

In [190]:
products.sort_values('price')

     id_prod   price categ
731      T_0   -1.00     0
2355   0_202    0.62     0
2272   0_528    0.62     0
370    0_120    0.66     0
1211  0_1844    0.77     0
...      ...     ...   ...
2779    2_30  233.54     2
1436   2_167  236.99     2
394    2_158  247.22     2
724     2_76  254.44     2
947      2_2  300.00     2

[3287 rows x 3 columns]

Nous avons un prix égal à -1, on voit que l'id_produit est écrit différement des autres (T_0).

On verra plus tard que ce produit est un produit test et qu'il est à supprimer.

## Fichier transactions

In [191]:
transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

### Exploration

In [192]:
transactions.info()
# pas de valeurs manquantes à priori

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 679532 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679532 non-null  object
 1   date        679532 non-null  object
 2   session_id  679532 non-null  object
 3   client_id   679532 non-null  object
dtypes: object(4)
memory usage: 20.7+ MB

In [193]:
transactions.describe(include='all')
# 20 produits non vendus (3287 id_products dans products) --> voir lesquels
# date bizarre --> identifier le problème
# 21 clients sans achats --> voir lesquels

       id_prod                             date session_id client_id
count   679532                           679532     679532    679532
unique    3267                           679371     342316      8602
top      1_369  test_2021-03-01 02:30:02.237413        s_0    c_1609
freq      2252                               13        200     25488

In [194]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3287 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3287 non-null   object
 1   price    3287 non-null   float64
 2   categ    3287 non-null   category
dtypes: category(1), float64(1), object(1)
memory usage: 54.8+ KB

In [195]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8623 entries, 0 to 8622
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8623 non-null   object
 1   sex        8623 non-null   category
 2   birth      8623 non-null   int64
 3   age        8623 non-null   int64
dtypes: category(1), int64(2), object(1)
memory usage: 210.8+ KB

### Traitement des valeurs manquantes

In [196]:
transactions.isna().sum()
# pas de valeurs manquantes

id_prod       0
date          0
session_id    0
client_id     0
dtype: int64

### Identification des anomalies de la colonnes date

In [197]:
transactions[transactions['date'].str.contains('test')]
# On voit que toutes ces transactions sont des tests

       id_prod                             date session_id client_id
3019       T_0  test_2021-03-01 02:30:02.237419        s_0      ct_0
5138       T_0  test_2021-03-01 02:30:02.237425        s_0      ct_0
9668       T_0  test_2021-03-01 02:30:02.237437        s_0      ct_1
10728      T_0  test_2021-03-01 02:30:02.237436        s_0      ct_0
15292      T_0  test_2021-03-01 02:30:02.237430        s_0      ct_0
...        ...                              ...        ...       ...
657830     T_0  test_2021-03-01 02:30:02.237417        s_0      ct_0
662081     T_0  test_2021-03-01 02:30:02.237427        s_0      ct_1
670680     T_0  test_2021-03-01 02:30:02.237449        s_0      ct_1
671647     T_0  test_2021-03-01 02:30:02.237424        s_0      ct_1
679180     T_0  test_2021-03-01 02:30:02.237425        s_0      ct_1

[200 rows x 4 columns]

In [198]:
transactions[transactions['date'].str.contains('test')]['client_id'].unique()
# 2 clients créés pour les tests, on pourra les supprimer de customers pour notre analyse

array(['ct_0', 'ct_1'], dtype=object)

In [199]:
transactions[transactions['date'].str.contains('test')]['id_prod'].unique()
# 1 produit créé pour les tests, on pourra le supprimer de products

array(['T_0'], dtype=object)

### Suppression des anomalies

In [200]:
# Suppression transactions tests
transactions.drop(transactions[transactions['date'].str.contains('test')].index, inplace=True)

In [201]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 679332 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679332 non-null  object
 1   date        679332 non-null  object
 2   session_id  679332 non-null  object
 3   client_id   679332 non-null  object
dtypes: object(4)
memory usage: 25.9+ MB

In [202]:
# Suppression du produit test, cela correspond au produit identifié plus haut au prix = -1
products.drop(products[products['id_prod']=='T_0'].index, inplace=True)

In [203]:
products.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3286 entries, 0 to 3286
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3286 non-null   object
 1   price    3286 non-null   float64
 2   categ    3286 non-null   category
dtypes: category(1), float64(1), object(1)
memory usage: 80.4+ KB

In [204]:
# Suppression des clients tests
customers.drop(customers[customers['client_id'].isin(['ct_0', 'ct_1'])].index, inplace=True)

In [205]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8621 entries, 0 to 8622
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8621 non-null   object
 1   sex        8621 non-null   category
 2   birth      8621 non-null   int64
 3   age        8621 non-null   int64
dtypes: category(1), int64(2), object(1)
memory usage: 277.9+ KB

### Traitement des doublons

In [206]:
transactions[transactions.duplicated()]
# il n'y a plus de doublons

Empty DataFrame
Columns: [id_prod, date, session_id, client_id]
Index: []

### Modification des unités

In [207]:
transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

In [208]:
# Modification de la colonne date au type datetime
transactions['date']=pd.to_datetime(transactions['date'])

In [209]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 679332 entries, 0 to 679531
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679332 non-null  object
 1   date        679332 non-null  datetime64[ns]
 2   session_id  679332 non-null  object
 3   client_id   679332 non-null  object
dtypes: datetime64[ns](1), object(3)
memory usage: 25.9+ MB

## Gestion des produits et clients sans transaction

### Clients sans transactions

In [210]:
clientclient=customers['client_id'].unique().tolist()
clienttransac=transactions['client_id'].unique().tolist()

clientseul=[]
for client in clientclient:
    if client not in clienttransac : clientseul.append(client)
print (clientseul)

# Ces clients n'ont aucune transactions, on ne les gardera pas dans l'analyse
customers.loc[customers['client_id'].isin(clientseul)].head()

['c_8253', 'c_3789', 'c_4406', 'c_2706', 'c_3443', 'c_4447', 'c_3017', 'c_4086', 'c_6930', 'c_4358', 'c_8381', 'c_1223', 'c_6862', 'c_5245', 'c_5223', 'c_6735', 'c_862', 'c_7584', 'c_90', 'c_587', 'c_3526']

     client_id sex  birth  age
801     c_8253   f   2001   22
2483    c_3789   f   1997   26
2734    c_4406   f   1998   25
2769    c_2706   f   1967   56
2851    c_3443   m   1959   64

In [211]:
prop = round(100*len(clientseul)/customers['client_id'].count(),2)
print(f'Ces clients sans transactions représentent {prop}% du nombre de clients total de customers.')

Ces clients sans transactions représentent 0.24% du nombre de clients total de customers.

### Produits sans transactions

In [212]:
productproduct=products['id_prod'].unique().tolist()
producttransac=transactions['id_prod'].unique().tolist()

produitseul=[]
for produit in productproduct:
    if produit not in producttransac : produitseul.append(produit)
print (produitseul)

# Ces clients n'ont aucune transactions, on ne les gardera pas dans l'analyse
products.loc[products['id_prod'].isin(produitseul)].head()

['0_1016', '0_1780', '0_1062', '0_1119', '0_1014', '1_0', '0_1318', '0_1800', '0_1645', '0_322', '0_1620', '0_1025', '2_87', '1_394', '2_72', '0_310', '0_1624', '2_86', '0_299', '0_510', '0_2308']

    id_prod  price categ
184  0_1016  35.06     0
279  0_1780   1.67     0
737  0_1062  20.08     0
794  0_1119   2.99     0
811  0_1014   1.15     0

In [213]:
prop2 = round(100*len(produitseul)/products['id_prod'].count(),2)
print(f'Ces produits sans transactions représentent {prop2}% du nombre de produits total de products.')

Ces produits sans transactions représentent 0.64% du nombre de produits total de products.

## Jointure

In [214]:
transactions.head()

  id_prod                       date session_id client_id
0  0_1518 2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251 2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277 2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209 2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509 2023-01-11 08:22:08.194479   s_325227    c_4232

In [215]:
products.head()

  id_prod  price categ
0  0_1421  19.99     0
1  0_1368   5.13     0
2   0_731  17.99     0
3   1_587   4.99     1
4  0_1507   3.99     0

In [216]:
customers.head()

  client_id sex  birth  age
0    c_4410   f   1967   56
1    c_7839   f   1975   48
2    c_1699   f   1984   39
3    c_5961   f   1962   61
4    c_5320   m   1943   80

In [217]:
inter = pd.merge(transactions, products, on='id_prod', how='left')
inter.head()

  id_prod                       date session_id client_id  price categ
0  0_1518 2022-05-20 13:21:29.043970   s_211425     c_103   4.18     0
1   1_251 2022-02-02 07:55:19.149409   s_158752    c_8534  15.99     1
2  0_1277 2022-06-18 15:44:33.155329   s_225667    c_6714   7.99     0
3   2_209 2021-06-24 04:19:29.835891    s_52962    c_6941  69.99     2
4  0_1509 2023-01-11 08:22:08.194479   s_325227    c_4232   4.99     0

In [219]:
df_global = pd.merge(inter, customers, on='client_id', how='left')
df_global.head()

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0,f,1986,37
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1,m,1988,35
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0,f,1968,55
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2,m,2000,23
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0,m,1980,43

### Traitement des valeurs manquantes

In [220]:
df_global.isna().sum()

id_prod         0
date            0
session_id      0
client_id       0
price         221
categ         221
sex             0
birth           0
age             0
dtype: int64

In [224]:
# les 221 lignes où il y a des valeurs manquantes pour price et categ (les colonnes issues de products)
df_global[df_global.isna().any(axis=1)]

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
2633,0_2245,2022-09-23 07:22:38.636773,s_272266,c_4746,NaN,NaN,m,1940,83
10103,0_2245,2022-07-23 09:24:14.133889,s_242482,c_6713,NaN,NaN,f,1963,60
11723,0_2245,2022-12-03 03:26:35.696673,s_306338,c_5108,NaN,NaN,m,1978,45
15670,0_2245,2021-08-16 11:33:25.481411,s_76493,c_1391,NaN,NaN,m,1991,32
16372,0_2245,2022-07-16 05:53:01.627491,s_239078,c_7954,NaN,NaN,m,1973,50
...,...,...,...,...,...,...,...,...,...
669533,0_2245,2021-08-25 09:06:03.504061,s_80395,c_131,NaN,NaN,m,1981,42
670484,0_2245,2022-03-06 19:59:19.462288,s_175311,c_4167,NaN,NaN,f,1979,44
671088,0_2245,2022-05-16 11:35:20.319501,s_209381,c_4453,NaN,NaN,m,1981,42
675480,0_2245,2022-02-11 09:05:43.952857,s_163405,c_1098,NaN,NaN,m,1986,37
677797,0_2245,2021-12-14 22:34:54.589921,s_134446,c_4854,NaN,NaN,m,1968,55

In [225]:
df_global[df_global.isna().any(axis=1)]['id_prod'].unique()
# Toutes ces lignes concernent les transaction d'un seul produit qui a pour id_prod '0_2245'

array(['0_2245'], dtype=object)

In [229]:
products.loc[products['id_prod']=='0_2245', :]

Empty DataFrame
Columns: [id_prod, price, categ]
Index: []

Aucun produit n'a cet id_prod dans products, cependant ce produit a été vendus 221 fois, ce qui n'est pas négligeable.

Les id_prod ont pour structure categ_numero, on sait donc que la catégorie de ce produit est 0.

On peut remplacer son prix par une moyenne, celle de sa catégorie par exemple.

In [284]:
df_global

,id_prod,date,session_id,client_id,price,categ,sex,birth,age
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0,f,1986,37
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1,m,1988,35
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0,f,1968,55
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2,m,2000,23
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0,m,1980,43
...,...,...,...,...,...,...,...,...,...
679327,0_1551,2022-01-15 13:05:06.246925,s_150195,c_8489,12.99,0,f,1951,72
679328,1_639,2022-03-19 16:03:23.429229,s_181434,c_4370,10.99,1,f,1977,46
679329,0_1425,2022-12-20 04:33:37.584749,s_314704,c_304,12.99,0,f,1988,35
679330,0_1994,2021-07-16 20:36:35.350579,s_63204,c_2227,4.98,0,m,1986,37
679331,1_523,2022-09-28 01:12:01.973763,s_274568,c_3873,23.99,1,m,1995,28